public class Main {
    public static void main(String[] args) {

        // Задание 1 - число 333 из шестандцатиричной в десятичную
        // 333(16) = 3 * 16^0 + 3*16^1 + 3*16^2 = 3 + 48 + 768 = 819
        // Результат: 819

        // Задание 2 - Разложить число 200345 на разряды в десятичной системе
        // Результат: 5*10^0 + 4*10^1 + 3*10^2 + 0*10^3 + 0*10^4 + 2*10^5

        // Задание 3 - Перевести 637 из десятичной в шестнадцатиричную и обратно (10->16 и 16->10)
        // 637/16 = 39
        // 637 % 16 = 13 (ост)
        // 39/16 = 2
        // 39%16 = 7 (ост)
        // 2/16 = 0
        // 2%16 = 2 (ост)
        // Результат1: 27(13)
        // Результат2: 13*16^0 + 7*16^1 + 2*16^2 = 13 + 112 + 512 = 525 + 112 = 637

        // Задание 4 - Перевести 637 из десятичной в двоичную
        // 637/2 = 318
        // 637%2 = 1 (ост)
        // 318/2 = 159
        // 318%2 = 0 (ост)
        // 159/2 = 79
        // 159%2 = 1 (ост)
        // 79/2 = 39
        // 79%2 = 1 (ост)
        // 39/2 = 19
        // 39%2 = 1 (ост)
        // 19/2 = 9
        // 19%2 = 1 (ост)
        // 9/2 = 4
        // 9%2 = 1 (ост)
        // 4/2 = 2
        // 4%2 = 0 (ост)
        // 2/2 = 1
        // 2%2 = 0 (ост)
        // 1/2 = 0
        // 1%2 = 1 (ост)
        // Результат : 1001111101

        // Задание 5 - 11100111 перевести в десятичную
        // 1*2^0 + 1*2^1 + 1*2^2 + 0*2^3 + 0*2^4 + 1*2^5 + 1*2^6 + 1*2^7 = 1+2+4+0+0+32+64+128 = 231
        // Результат = 231

        // Задание 6 - Перевести 637 из десятичной в троичную
        // 637/3 = 212
        // 637%3 = 1 (ост)
        // 212/3 = 70
        // 212%3 = 2 (ост)
        // 70/3 = 23
        // 70%3 = 1 (ост)
        // 23/3 = 7
        // 23%3 = 2 (ост)
        // 7/3 = 2
        // 7%3 = 1 (ост)
        // 2/3 = 0
        // 2%3 = 2 (ост)
        // Результат : 212121





    }
}